"""
Модуль для отображения графики игры
"""


def draw_gallows(attempts: int) -> str:
    """Отрисовка виселицы"""
    hangman_stages: list = [
        """
           ------
           |    |
           |    0
           |   /|\\
           |    |
           |   / \\
           |
        --------
        """,
        """
            ------
            |    |
            |    O
            |   /|\\
            |    |
            |   /
            |
            |
        --------
        """,
        """
            ------
            |    |
            |    O
            |   /|\\
            |    |
            | 
            |
            |
        --------
        """,
        """
           ------
           |    |
           |    O
           |   /|
           |    |
           | 
           |
           |
        --------
        """,
        """
           ------
           |    |
           |    O
           |    |
           |    |
           |   
           |
           |
        --------
        """,
        """
           ------
           |    |
           |    O
           |
           |
           |
           |
           |
        --------
        """,
        """
            ------
            |    |
            |
            |
            |
            |
            |
            |
        --------
            """]
    return hangman_stages[attempts]
